// Обычный урок:
//   { subject: 'Математика', room: '301', teacher: 'Петров С. Н.' }
// Урок с группами:
//     groupType: 'english',   // или 'native'
//     groups: {
//       '1': { subject: 'Английский',  room: '405', teacher: 'Смирнова Н. А.' },
//       '2': { subject: 'Информатика', room: '401', teacher: 'Соколов И. В.' }

const SCHEDULE = {

  'Понедельник': {
    bells: [
      '8:00-8:30',
      '8:45-9:25',
      '9:40-10:20',
      '10:35-11:15',
      '11:30-12:10',
      '12:20-13:00',
      '13:10-13:50'
    ],
    lessons: [
      { subject: 'Разговоры о важном'},
      { subject: 'Вероятность и статистика'},
      { subject: 'Русский язык'},
      { subject: 'География'},
      { subject: 'Физика'},
      { subject: 'Биология'},
      { subject: 'Русский'}
    ]
  },

  'Вторник': {
    bells: [
      '8:00-8:45',
      '9:00-9:45',
      '10:00-10:45',
      '11:00-11:45',
      '12:00-12:45',
      '12:55-13:40'
    ],
    lessons: [
      { subject: 'Геометрия'},
      { subject: 'Русский язык'},
     {
        groupType: 'english',
        groups: {
          '1': { subject: 'Английский язык'},
          '2': { subject: 'Английский язык'}
        }
      },
      { subject: 'История'},
      { subject: 'ОБЖ'},
      { subject: 'История'}
    ]
  },

  'Среда': {
    bells: [
      '8:00-8:45',
      '9:00-9:45',
      '10:00-10:45',
      '11:00-11:45',
      '12:00-12:45',
      '12:55-13:40'
    ],
    lessons: [
      { subject: 'Химия'},
      { subject: 'История'},
      { subject: 'Алгебра'},
      { subject: 'Литература'},
           {
        groupType: 'english',
        groups: {
          '1': { subject: 'Английский язык'},
          '2': { subject: 'Английский язык'}
        }
      },
      {
        groupType: 'native',
        groups: {
          '1': { subject: 'Родной язык'},
          '2': { subject: 'Татарский язык'}
        }
      }
    ]
  },

  'Четверг': {
    bells: [
      '8:00-8:30',
      '8:45-9:25',
      '9:40-10:20',
      '10:35-11:15',
      '11:30-12:10',
      '12:20-13:00',
      '13:10-13:50'
    ],
    lessons: [
      { subject: 'Разговоры о важном' },
      { subject: 'Биология'},
      { subject: 'Физика'},
      { subject: 'Алгебра'},
      { subject: 'Русский язык'},
      { subject: 'Технология'},
      { subject: 'География'}
    ]
  },

  'Пятница': {
    bells: [
      '8:00-8:45',
      '9:00-9:45',
      '10:00-10:45',
      '11:00-11:45',
      '12:00-12:45',
      '12:55-13:40'
    ],
    lessons: [
           {
        groupType: 'english',
        groups: {
          '1': { subject: 'Английский язык'},
          '2': { subject: 'Информатика'}
        }
      },
           {
        groupType: 'english',
        groups: {
          '1': { subject: 'Информатика'},
          '2': { subject: 'Английский язык'}
        }
      },
      {
        groupType: 'native',
        groups: {
          '1': { subject: 'Родная литература'},
          '2': { subject: 'Татарский'}
        }
      },
      { subject: 'Геометрия'},
      { subject: 'Химия'},
      { subject: 'Физкультура'}
    ]
  },

  'Суббота': {
    bells: [
      '8:00-8:40',
      '8:55-9:35',
      '9:50-10:30',
      '10:45-11:25',
      '11:40-12:20',
      '12:30-13:10'
    ],
    lessons: [
      { subject: 'Физкультура'},
      { subject: 'Алгебра'},
      { subject: 'Литература'},
      {
        groupType: 'native',
        groups: {
          '1': { subject: 'Родной язык'},
          '2': { subject: 'Татарский язык'}
        }
      },
      { subject: 'ПиИД'},
      { subject: 'Музыка'}
    ]
  }

};